---
type: RadioButtonGroupData
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# RadioButtonGroupData

`Autodesk.Revit.UI.RadioButtonGroupData` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RadioButtonGroupData | 2011 | `public RadioButtonGroupData ( string name )` |